[
  "Alameda",
  "CA",
  "https://vetrelief.goodbarber.app/docs/Job%20ID_106092%20Alameda%20CA.png",
  " \n\n\n\nWe are a thriving integrative veterinary hospital that is seeking a PT veterinarian 1-2 days per week.  Located in beautiful and quaint Alameda, CA, the practice sits within easy access to major highways and is a reverse commute from most areas to Alameda.  \n\nWe have recently expanded our new facility - the peaceful and technology-forward work environment is a very pleasant place to practice high-quality veterinary medicine.  Full dental suites, full surgical suite, 5 exam rooms, Idexx lab equipment, large treatment area.  Digital dental and full-body radiology suite, ultrasound, stem cell processing lab. \n\nThe ideal candidate communicates willingly and with a generosity of spirit to our clientele.  Our clients enjoy a 'high-touch experience'.  \n\nWe practice Western as well as Eastern medicine modalities: (Chinese herbal therapy, acupuncture, chiropractic, and cold laser therapy. We are one of the few hospitals in the area that offer Stem Cell Therapy, from start to finish same day, on-premise.\n\nCultural fit is important to all of us. Our hospital is a true team environment; we truly care about\nour patients and have a very loyal client demographic. Our doctors take the time to listen and\nmaintain relationships with our clients and patients. We really love what we do, and it shows!\nOur environment is light and warm with lots of natural light and a modern aesthetic. We are\nblessed with a beautiful marina, green space, and walking paths- great for a break between patients.\nThe ideal candidate has excellent communication skills, is comfortable recommending an\nintegrative approach to treatment, and enjoys surgery and dentistry. He/ she will be collegiate,\nwill establish strong client relationships, and work well with an experienced, diverse staff.\nInterest or experience in holistic modalities is a big plus.\nWe believe in balance; the full-time workweek is 4 days, 9 am-6 pm. We offer great benefits for\nall full-time staff; medical, dental, and vision- fully paid. We also support continuing education\nand take care of licensing renewal and professional dues. We are an independently owned,\nprofessionally managed hospital.\n\nThank you for your interest!\n\n\nPlease consider applying for some of our needed relief dates as well!:\nFri, Mar-01-2024 8:30-6pm\nMon, Mar-04-2024 8:30-6pm\nWed, Mar-06-2024 8:30-6pm\nThu, Mar-07-2024 8:30-6pm\nFri, Mar-08-2024 8:30-6pm\nMon, Mar-11-2024 8:30-6pm\nWed, Mar-13-2024 8:30-6pm\nThu, Mar-14-2024 8:30-6pm\nFri, Mar-15-2024 8:30-6pm\nMon, Mar-18-2024 8:30-6pm\nWed, Mar-20-2024 8:30-6pm\nThu, Mar-21-2024 8:30-6pm\nFri, Mar-22-2024 8:30-6pm\nMon, Mar-25-2024 8:30-6pm\nWed, Mar-27-2024 8:30-6pm\nThu, Mar-28-2024 8:30-6pm\nFri, Mar-29-2024 8:30-6pm\nJob ID#110533\nClick here for more info or to submit bid on Relief Job ID#110533\n\n\nMon, Apr-01-2024 8:30-6pm\nWed, Apr-03-2024 8:30-6pm\nThu, Apr-04-2024 8:30-6pm\nFri, Apr-05-2024 8:30-6pm\nMon, Apr-08-2024 8:30-6pm\nWed, Apr-10-2024 8:30-6pm\nThu, Apr-11-2024 8:30-6pm\nFri, Apr-12-2024 8:30-6pm\nMon, Apr-15-2024 8:30-6pm\nWed, Apr-17-2024 8:30-6pm\nThu, Apr-18-2024 8:30-6pm\nFri, Apr-19-2024 8:30-6pm\nMon, Apr-22-2024 8:30-6pm\nWed, Apr-24-2024 8:30-6pm\nThu, Apr-25-2024 8:30-6pm\nFri, Apr-26-2024 8:30-6pm\nMon, Apr-29-2024 8:30-6pm\nJob ID#110534\nClick here for more info or to submit bid on Relief Job ID#110534\n\n\nWed, May-01-2024 8:30-6pm\nThu, May-02-2024 8:30-6pm\nFri, May-03-2024 8:30-6pm\nMon, May-06-2024 8:30-6pm\nWed, May-08-2024 8:30-6pm\nThu, May-09-2024 8:30-6pm\nFri, May-10-2024 8:30-6pm\nMon, May-13-2024 8:30-6pm\nWed, May-15-2024 8:30-6pm\nThu, May-16-2024 8:30-6pm\nFri, May-17-2024 8:30-6pm\nMon, May-20-2024 8:30-6pm\nWed, May-22-2024 8:30-6pm\nThu, May-23-2024 8:30-6pm\nFri, May-24-2024 8:30-6pm\nWed, May-29-2024 8:30-6pm\nThu, May-30-2024 8:30-6pm\nFri, May-31-2024 8:30-6pm\nJob ID#110535\nClick here for more info or to submit bid on Relief Job ID#110535\n\n\n\n\n",
  [
    "Small animal"
  ]
]