[
  "San Francisco",
  "CA",
  "https://vetreliefhosp.goodbarber.app/docs/109313%20San%20Francisco%20v2%20%281%29.png",
  " We are looking for 2 Associate Veterinarians to join our team! Relief is welcome as a PT or FT extension of our diverse and dynamic team.\n\n\nOur highly skilled and incredibly well leveraged staff is looking to keep things rolling at the highest level of patient/client care we can provide. We are looking for a relief veterinarian to join us as part of the extended IPH team. Team IPH will make you feel welcome from the moment you step in the door.\n\n\nExpanded, remodeled, and completely renovated.\n\n\nWe have embraced the demand for services in SF by adding 8 brand new exam rooms, two dental suites, two operating rooms, a room dedicated for special procedures, urgent care with a dedicated treatment room, and all the brand new state-of-the-art equipment you could hope for. Additionally, we have separate entrances for our cats and dogs. We are looking to add 2 additional veterinarians to our 6 doctor practice. Fully staffed with a dedicated and diverse team, including RVT's VTS, and CVA's.\n\n\nWe honor and respect work/life balance, which is why we are looking for new additions to our ever growing hospital.\n\n\nIf you're a veterinarian looking to provide relief or become a part of a collaborative group of veterinarians with passion for the industry and the patients they serve then our hospital is for you. We are looking for candidates with vibrant personalities, we're also looking for a professional who is:\n\n\nDriven to provide exemplary service and care every single day\nA good communicator who makes client education a priority\nOrganized and likes a very fast pace\nSkilled in medical and surgical technique\nSkilled dental technique\nInterest in Urgent Care\n\n\nNew graduates are welcome to apply!\n\n\nWe're a privately owned and operated AAHA-accredited practice that has been serving San Francisco for over 50 years.\n\n\nAlternative work week (4 days, 10 hours)\nPaid vacations & holidays\nLiability insurance\nLicenses (state, DEA, VIN, SFVMA membership)\nVested retirement plan after qualified employment\nAllowances for continued education, uniforms, and membership dues\nWellness allowance\nPet discounts\nAn extremely smart, fun, dedicated staff\n\n\nIf you're ready to work in a place that, regardless of the challenge, is committed to the community, our clients, our patients, and to each other, then we want to meet you!\n\n\n"
]