[
  "Visalia",
  "CA",
  "https://vetrelief.goodbarber.app/docs/110117_VisaliaCA.png",
  " Salary varies from part-time to full-time but the range is $110,000-140,000 per year!!\n\nJoin the largest (over 23k followers on Facebook) non-profit no kill rescue and veterinary clinic in Tulare County. We are located in the central valley of California, where the cost of living is low and access to the mountains and beaches are just a short drive away.\n\nOur team is friendly, positive, supportive and professional. We are proud to say that we love what we do each day and it shows in our work quality.\n\nYou will fit right in if:\n\n·        You want to provide compassionate and ethical care to client and patients\n\n·        You have a sense of humor - Life can’t always be so serious\n\n·        You enjoy a positive environment - We support each other through everything\n\n·        You enjoy working as a team but can work independently too\n\nDid you know? That working for a non-profit qualifies you for the Public Service Loan Forgiveness. Let our non-profit status help pay for those student loans.\n\n·        Full time position is 4-5 days a week. Approx. 35 hours per week.\n\n·        Part Time position is 2-3 days a week. Approx. 28-30 hours per week.\n\n·        We can customize our schedule to meet your needs and preference.\n\n·        We do not work federal holidays, but you still get paid\n\nFamily and Life work balance is very important for our team members!\n\n\n\n\nThe scope of the work required is:\n\n·        Spays and Neuters for the public and our adoption center animals.\n\n·        Overseeing our daily vaccination clinic\n\n·        Medical exams for the public and overseeing the health of the animals at our adoption center.\n\n·        Surgical procedures such as mass removals and other soft tissue surgeries per your ability and comfort level.\n\n\n\n\n\nPlease consider applying for some of our needed relief dates as well!:\nFri, Nov-03-2023 8:30am-2:30pm\nSat, Nov-04-2023 \nFri, Nov-10-2023 8:30am-2:30pm\nSat, Nov-11-2023 \nFri, Nov-17-2023 8:30am-2:30pm\nSat, Nov-18-2023 \nFri, Nov-24-2023 8:30am-2:30pm\nSat, Nov-25-2023 \nFri, Dec-01-2023 8:30am-2:30pm\nSat, Dec-02-2023 \nFri, Dec-08-2023 8:30am-2:30pm\nSat, Dec-09-2023 \nFri, Dec-15-2023 8:30am-2:30pm\nSat, Dec-16-2023 \nFri, Dec-22-2023 8:30am-2:30pm\nSat, Dec-23-2023 \nFri, Dec-29-2023 8:30am-2:30pm\nSat, Dec-30-2023 \n\nClick here for more info or to submit bid on Relief Job ID#110116\n\n",
  [
    "Small animal",
    "Vaccine clinic",
    "Spay and Neuter"
  ]
]