[
  "Rancho Cucamonga",
  "CA",
  "https://vetrelief.goodbarber.app/docs/110254_RanchoCucamonga%20%281%29.png",
  " \n\n\n\n$50K to $75K Signing Bonus!\nCompassionate Veterinarian needed to make a difference in people’s lives! \n\nLooking for an Associate Veterinarian that can help create positive change in people’s lives through compassionate care for their pets. While working as part of our dynamic team you will provide quality veterinary care to our patients.\n\nWho we are:\nWe offer compassionate and affordable veterinary care for cats and dogs in Rancho Cucamonga and the surrounding area. We believe in keeping your pet happy and healthy at all times and treat all pets with compassion and love because they truly are valued members of our family. We are a full-service animal hospital with a wide range of services including wellness packages, vaccinations, dental care, comprehensive medical care and orthopedic surgery. Our state of the art facility was newly built in 2019 and features digital radiology, ultrasound, a comprehensive and fully equipped laboratory, digital dental x-ray, laser therapy and electronic medical records. \n\nExceptional Staff:\nOur technical staff are composed of registered veterinary technicians and veterinary assistants with many years of experience. It is our priority to ensure that our hospital is well staffed, helping guarantee our clients are cared for and our veterinarians are supported. We provide more structure and support than most regional hospitals!\n\nWho we want:\nWe are looking for an enthusiastic, personable F/T associate Veterinarian. Someone who can handle the medical aspects of the job while delivering compassion and care to our patients and clients. Coaching and educating are important to us as we strive to create a collaborative environment where you can discuss cases among your colleagues.\n\nWe provide:\n$150,000 to $200,000 dependent upon experience, skills and schedule\n$50,000 to $75,000 signing bonus pro-rated over a 2 year commitment \nConsistent and predictable schedule\nGenerous CE allowance\nPaid CE days\nMedical insurance\nProfessional Liability Insurance\nPaid time off\nPaid Sick leave\nRetirement plan\nVMD or DVM, CA State Veterinary License, DEA\nAll interested candidates, please apply!",
  [
    "Small animal"
  ]
]